{
    "inicio": {
        "nombre": "Leonel",
        "apellido": "Caballero",
        "profesion": "Desarrollador Web",
        "stack": "Full Stack",
        "imagen": "img/image-default.png"
    },
    "acercaDeMi": {
        "descripcion": "Desarrollador Front-End y Técnico en Soporte IT con más de 4 años de experiencia en desarrollo web y soporte técnico. Competente en el uso de tecnologías orientadas al front-end y back-end como HTML, CSS, JavaScript, ReactJS, Angular, PHP y Laravel, así como en la administración de redes y soporte a usuarios. Apasionado por crear aplicaciones web funcionales y atractivas, y con sólidos conocimientos en metodologías ágiles."
    },
    "experiencias": [
        {
            "titulo": "Desarrollo Web Front-End y Back-End + Infraestructura y Soporte IT",
            "lugar": "Municipalidad de Berisso - Dirección de Sistemas",
            "fecha": "Octubre 2020 - Actualidad",
            "descripcion": "Resolución de incidentes técnicos y soporte diario a más de 1700 empleados en un entorno de dominio, gestionando problemas de hardware y software. Desarrollo y mantenimiento del sitio web berisso.gob.ar, optimizando su rendimiento y accesibilidad. Instalación, configuración y mantenimiento de equipos informáticos (PCs, impresoras y dispositivos de red). Administración de redes cableadas e inalámbricas, configuración de routers y switches, garantizando conectividad estable y segura. Implementación de políticas de seguridad informática y gestión de respaldos, asegurando la protección de los datos y sistemas.",
            "link": "http://berisso.gob.ar"
        },
        {
            "titulo": "Proyecto Web Clínica Mosconi",
            "lugar": "Clínica Mosconi de Berisso",
            "fecha": "Julio 2021 - dicimebre 2021",
            "descripcion": "El proyecto para la Clínica Mosconi de Berisso consistió en el desarrollo de un sitio web moderno, responsivo y accesible, diseñado para mejorar la experiencia de los pacientes. Incluye secciones clave como inicio, servicios, turnos online y contacto, integrando un sistema ágil para la solicitud de turnos y un diseño adaptado a dispositivos móviles. Utilizando tecnologías como Laravel, MySQL, HTML5, CSS3, Bootstrap 5, JavaScript, se logró una solución segura, funcional y optimizada para buscadores, reflejando la profesionalidad de la clínica y facilitando la interacción de los usuarios con sus servicios.",
            "link": "https://github.com/extah/clinicamosconi"
        },
        {
            "titulo": "Proyecto Sitio Web - Ad Honorem",
            "lugar": "Fundación Beatriz Ramseyer (Córdoba)",
            "fecha": "Junio 2020 - Agosto 2020",
            "descripcion": "El proyecto consistió en el desarrollo ad honorem de un sitio web para la Fundación Beatriz Ramseyer, ubicada en Córdoba, con el objetivo de difundir sus iniciativas solidarias y fortalecer su presencia en línea. El sitio incluye secciones clave como “Nosotros” (historia y misión), “Programas” (detalles de sus proyectos solidarios), “Colaborá” (opciones para donaciones y voluntariado) y “Contacto”. El diseño es responsivo, accesible y optimizado para buscadores, asegurando una experiencia inclusiva para todos los usuarios. Se emplearon tecnologías modernas como NodeJS, HTML5, CSS3, Bootstrap 5, JavaScript y MySQL, garantizando un desarrollo ágil y eficiente. Este proyecto reflejó el compromiso social y permitió potenciar la visibilidad de las valiosas acciones de la fundación en su comunidad y más allá. Referencia: Carlos Balestrieri, Cel: 11-57642207. https://www.instagram.com/fundacion_ramseyer/",
            "link": "https://github.com/eogieglo/Fundacion_Ramseyer"
        }
    ],
    "educacion": [
        {
            "institucion": "ISFT N°202",
            "titulo": "Técnico Superior en Redes Informáticas",
            "fecha": "2017 - 2019"
        },
        {
            "institucion": "Digital House Coding School",
            "titulo": "Programación Web Full Stack",
            "fecha": "2019 - 2020",
            "descripcion": "HTML5, CSS3, Bootstrap, Flexbox, PHP + POO, Git/GitHub, MySQL, JavaScript, Laravel. Metodologías Ágiles, Scrum."
        },
        {
            "institucion": "Plan Argentina Programa: #YoProgramo",
            "titulo": "Desarrollo de SPA",
            "fecha": "2022",
            "descripcion": "HTML, CSS, JavaScript, TypeScript, Angular, POO, Java, Java Spring Boot, MySQL."
        }
    ],
    "proyectos": [
        {
            "nombre": "Shopping Cart",
            "fecha": "2023",
            "github": "https://github.com/leoocaba/shopping-cart",
            "link": "https://leoocaba.github.io/shopping-cart",
            "descripcion": "Aplicación desarrollada con ReactJS para la simulación de un carrito de compras."
        },
        {
            "nombre": "Movie Finder",
            "fecha": "2023",
            "github": "https://github.com/leoocaba/movie-finder",
            "link": "https://leoocaba.github.io/movie-finder",
            "descripcion": "Aplicación ReactJS para buscar películas utilizando una API pública."
        },
        {
            "nombre": "App Clima",
            "fecha": "2023",
            "github": "https://github.com/leoocaba/app-clima",
            "link": "https://leoocaba.github.io/app-clima",
            "descripcion": "Aplicación para consultar el clima actual en diferentes ciudades, desarrollada con ReactJS."
        },
        {
            "nombre": "Southsurf",
            "fecha": "2023",
            "link": "https://leoocaba.github.io/southsurf/",
            "descripcion": "Diseño UI y front-end de un sitio web sobre surf."
        }
    ],
    "login": {
        "emailPlaceholder": "Correo Electrónico",
        "passwordPlaceholder": "Contraseña"
    },
    "redesSociales": {
        "github": "https://github.com/leoocaba",
        "linkedIn": "https://www.linkedin.com/in/leonel-marcelo-caballero-6a1a3318a/",
        "whatsApp": "https://wa.me/+542216168896"
    }
}