{
    "inicio": {
        "nombre": "Leonel",
        "apellido": "Caballero",
        "profesion": "Desarrollador Web",
        "stack": "Full Stack",
        "imagen": "img/image-default.png"
    },
    "acercaDeMi": {
        "descripcion": "Desarrollador Front-End y Técnico en Soporte IT con más de 4 años de experiencia en desarrollo web y soporte técnico. Competente en el uso de tecnologías orientadas al front-end y back-end como HTML, CSS, JavaScript, ReactJS, Angular, PHP y Laravel, así como en la administración de redes y soporte a usuarios. Apasionado por crear aplicaciones web funcionales y atractivas, y con sólidos conocimientos en metodologías ágiles."
    },
    "experiencias": [
        {
            "titulo": "Desarrollo Web Front-End y Back-End + Infraestructura y Soporte IT",
            "lugar": "Municipalidad de Berisso - Dirección de Sistemas",
            "fecha": "Octubre 2020 - Actualidad",
            "descripcion": "Resolución de incidentes técnicos y soporte diario a más de 1700 empleados en un entorno de dominio, gestionando problemas de hardware y software. Desarrollo y mantenimiento del sitio web berisso.gob.ar, optimizando su rendimiento y accesibilidad. Instalación, configuración y mantenimiento de equipos informáticos (PCs, impresoras y dispositivos de red). Administración de redes cableadas e inalámbricas, configuración de routers y switches, garantizando conectividad estable y segura. Implementación de políticas de seguridad informática y gestión de respaldos, asegurando la protección de los datos y sistemas.",
            "link": "http://berisso.gob.ar"
        },
        {
            "titulo": "Proyecto Web Clínica Mosconi",
            "lugar": "Clínica Mosconi de Berisso",
            "fecha": "Julio 2021 - dicimebre 2021",
            "descripcion": "El proyecto para la Clínica Mosconi de Berisso consistió en el desarrollo de un sitio web moderno, responsivo y accesible, diseñado para mejorar la experiencia de los pacientes. Incluye secciones clave como inicio, servicios, turnos online y contacto, integrando un sistema ágil para la solicitud de turnos y un diseño adaptado a dispositivos móviles. Utilizando tecnologías como Laravel, MySQL, HTML5, CSS3, Bootstrap 5, JavaScript, se logró una solución segura, funcional y optimizada para buscadores, reflejando la profesionalidad de la clínica y facilitando la interacción de los usuarios con sus servicios.",
            "link": "https://github.com/extah/clinicamosconi"
        },
        {
            "titulo": "Proyecto Sitio Web - Ad Honorem",
            "lugar": "Fundación Beatriz Ramseyer (Córdoba)",
            "fecha": "Junio 2020 - Agosto 2020",
            "descripcion": "El proyecto consistió en el desarrollo ad honorem de un sitio web para la Fundación Beatriz Ramseyer, ubicada en Córdoba, con el objetivo de difundir sus iniciativas solidarias y fortalecer su presencia en línea. El sitio incluye secciones clave como “Nosotros” (historia y misión), “Programas” (detalles de sus proyectos solidarios), “Colaborá” (opciones para donaciones y voluntariado) y “Contacto”. El diseño es responsivo, accesible y optimizado para buscadores, asegurando una experiencia inclusiva para todos los usuarios. Se emplearon tecnologías modernas como NodeJS, HTML5, CSS3, Bootstrap 5, JavaScript y MySQL, garantizando un desarrollo ágil y eficiente. Este proyecto reflejó el compromiso social y permitió potenciar la visibilidad de las valiosas acciones de la fundación en su comunidad y más allá. Referencia: Carlos Balestrieri, Cel: 11-57642207. https://www.instagram.com/fundacion_ramseyer/",
            "link": "https://github.com/eogieglo/Fundacion_Ramseyer"
        }
    ],
    "educacion": [
        {
            "institucion": "ISFT N°202",
            "titulo": "Técnico Superior en Redes Informáticas",
            "fecha": "2017 - 2019"
        },
        {
            "institucion": "Digital House Coding School",
            "titulo": "Programación Web Full Stack",
            "fecha": "2019 - 2020",
            "descripcion": "HTML5, CSS3, Bootstrap, Flexbox, PHP + POO, Git/GitHub, MySQL, JavaScript, Laravel. Metodologías Ágiles, Scrum."
        },
        {
            "institucion": "Plan Argentina Programa: #YoProgramo",
            "titulo": "Desarrollo de SPA",
            "fecha": "2022",
            "descripcion": "HTML, CSS, JavaScript, TypeScript, Angular, POO, Java, Java Spring Boot, MySQL."
        }
    ],
    "proyectos": [
        {
            "nombre": "Shopping Cart",
            "fecha": "diciembre 2024",
            "github": "https://github.com/leoocaba/shopping-cart",
            "link": "https://leoocaba.github.io/shopping-cart",
            "descripcion": "Shopping Cart es una aplicación web diseñada para seleccionar productos, gestionarlos en un carrito y visualizar un resumen de las compras, destacando por su diseño moderno, rápido y responsivo. Desarrollada con React 19 y Context API para el manejo de estado, integra datos desde la API pública Fake Store API. Además, utiliza Material UI y Bootstrap 5 para un diseño adaptable y atractivo, junto con react-router-dom para la navegación de rutas y una configuración optimizada con Vite. Este proyecto, disponible en GitHub Pages, refleja mi aprendizaje en hooks de React y la creación de componentes reutilizables, combinando lógica y diseño de manera efectiva.",
            "imagen": "img/shopping-cart.png",
            "tecnologias": [
                "ReactJS",
                "JavaScript",
                "HTML5",
                "CSS3",
                "Bootstrap 5"
            ]
        },
        {
            "nombre": "Movie Finder",
            "fecha": "julio 2024",
            "github": "https://github.com/leoocaba/movie-finder",
            "link": "https://leoocaba.github.io/movie-finder",
            "descripcion": "Movie Finder es una aplicación web que permite buscar películas y explorar su información utilizando la API de The Movie Database (TMDb). Desarrollada con React 19 y Bootstrap 5, cuenta con una interfaz moderna, dinámica y responsiva, adaptable a cualquier dispositivo. Entre sus funcionalidades destacan: una barra de búsqueda para encontrar películas fácilmente, tarjetas informativas que presentan detalles clave, y la opción de leer sinopsis completas. Este proyecto, desplegado en GitHub Pages, es un ejemplo práctico de integración API y diseño frontend enfocado en la experiencia del usuario.",
            "imagen": "img/movie-finder.png",
            "tecnologias": [
                "ReactJS",
                "JavaScript",
                "HTML5",
                "CSS3",
                "Bootstrap 5"
            ]
        },
        {
            "nombre": "App Clima",
            "fecha": "junio 2024",
            "github": "https://github.com/leoocaba/app-clima",
            "link": "https://leoocaba.github.io/app-clima",
            "descripcion": "Weather App es una aplicación web desarrollada con ReactJS que permite consultar el clima de cualquier ciudad en tiempo real. Integra APIs de OpenWeatherMap y Geonames para proporcionar datos meteorológicos precisos y búsquedas inteligentes de ciudades, mientras que Bootstrap asegura un diseño responsivo y atractivo. Entre sus características destacan sugerencias automáticas de ciudades, detección de ubicación para mostrar el clima local, y datos climáticos actualizados. Desplegada en GitHub Pages, este proyecto refleja mi aprendizaje en integración de APIs, manejo de estado y errores en ReactJS, y despliegue eficiente de aplicaciones web.",
            "imagen": "img/app-clima.png",
            "tecnologias": [
                "ReactJS",
                "JavaScript",
                "HTML5",
                "CSS3",
                "Bootstrap 5"
            ]
        },
        {
            "nombre": "Southsurf",
            "fecha": "junio 2021",
            "github": "https://github.com/leoocaba/southsurf",
            "link": "https://leoocaba.github.io/southsurf/",
            "descripcion": "SouthSurf es una aplicación web estática desarrollada con HTML5, CSS3, Bootstrap y JavaScript, enfocada en ofrecer una experiencia visual atractiva y moderna para los amantes del surf. Diseñada como un proyecto de UI/UX, cuenta con un diseño completamente responsive, efectos interactivos y una estructura optimizada para distintos dispositivos. Aunque no contiene datos reales ni funcionalidades dinámicas, SouthSurf es un ejemplo del equilibrio entre diseño y usabilidad en el desarrollo web frontend.",
            "imagen": "img/southsurf.png",
            "tecnologias": [
                "HTML5",
                "CSS3",
                "Bootstrap 5",
                "JavaScript"
            ]
        }
    ],
    "login": {
        "emailPlaceholder": "Correo Electrónico",
        "passwordPlaceholder": "Contraseña"
    },
    "redesSociales": {
        "github": "https://github.com/leoocaba",
        "linkedIn": "https://www.linkedin.com/in/leonel-marcelo-caballero-6a1a3318a/",
        "whatsApp": "https://wa.me/+542216168896"
    }
}